{"Matt Damon plays angry Kavanaugh in 'SNL' open - CNN Video": "https://www.cnn.com/videos/cnnmoney/2018/09/30/saturday-night-live-brett-kavanaugh-hearing-snl-epr-vstop-orig.cnn", "'Saturday Night Live': Matt Damon surprises at Brett Kavanaugh": "https://www.usatoday.com/story/life/entertainthis/2018/09/30/saturday-night-live-cold-open-matt-damon-brett-kavanaugh/1477589002/", "A very angry Matt Damon guest stars as Brett Kavanaugh on 'SNL ...": "https://abcnews.go.com/Politics/angry-matt-damon-guest-stars-brett-kavanaugh-snl/story?id=58180849", "title": "'SNL' has Matt Damon play an angry Brett Kavanaugh", "author": "Frank Pallotta", "publish_date": "2018-09-30", "img_src": "https://cdn.cnn.com/cnnnext/dam/assets/180929233801-saturday-night-live-kavanaugh-damon-super-tease.jpg", "text": "New York (CNN) \"Saturday Night Live\" kicked off its season premiere Saturday with a sketch about this week's hearing of US Supreme Court nominee Brett Kavanaugh. The twist? Kavanaugh was played by Matt Damon.\n\nThe 44th season premiere of the NBC sketch series opened with Damon playing an angry Kavanaugh screaming at the Senate committee asking him questions.\n\n\"WHAT?!\" Damon's Kavanaugh said, opening the hearing. \"Let me tell you this, I'm going to start at an 11 then I'm going to take it to a 15 real quick!\"\n\nDamon's Kavanaugh explained that he wrote his statement the night before while \"screaming into an empty bag of Doritos.\"\n\n\"I'm usually an optimist,\" Damon said as the nominee. \"I'm a keg-half-full kind of guy, but what I've seen from the monsters on this committee makes me want to puke ... and not from beer!\"\n\nNow it's time to hear from Judge Brett Kavanaugh (Matt Damon). #SNLPremiere pic.twitter.com/dvu1VgJZt5 — Saturday Night Live - SNL (@nbcsnl) September 30, 2018\n\nRead More", "summary": ["The 44th season premiere of the NBC sketch series opened with Damon playing an angry Kavanaugh screaming at the Senate committee asking him questions.", "New York (CNN) \"Saturday Night Live\" kicked off its season premiere Saturday with a sketch about this week's hearing of US Supreme Court nominee Brett Kavanaugh.", "\"I'm a keg-half-full kind of guy, but what I've seen from the monsters on this committee makes me want to puke ... and not from beer!\"", "\"Let me tell you this, I'm going to start at an 11 then I'm going to take it to a 15 real quick!\"", "Damon's Kavanaugh explained that he wrote his statement the night before while \"screaming into an empty bag of Doritos.\"", "\"I'm usually an optimist,\" Damon said as the nominee.", "Damon's Kavanaugh said, opening the hearing."], "score": 0.0, "magnitude": 1.7000000476837158}